'''
- 각 사이트별 상, 중, 하단 이미지 임의 변경을 위한 url 목록
- [Batch_BASIC.py]의 사이트명 목록과 같은 순서임 참고
'''

IMAGES = {
	"샘플": { 
		"상": ["https://vans_상단_이미지.jpg", "https://vans_상품이미지보다_위.png"],
		"중": ["https://vans_가운데_이미지.jpg", "https://vans_설명문구보다_위.jpeg"],
		"하": ["https://vans_하단_이미지.jpg", "https://vans_사이즈표.webp", "https://배송_안내_이미지.jpg"],
	},
	"default": {
		"상": ["https://m.media-amazon.com/images/G/01/Zappos/Ralph-Lauren-May-2023/Ralph-Lauren-Mens-MGrid.jpg"],
		"중": ["https://www.zappos.com/boutiques/3130/poloralphlauren_header110122.gif"],
		"하": ["https://shop-phinf.pstatic.net/20231228_296/1703718751132RIyXT_JPEG/sizechartlogo.jpg?type=w860"],
	},
	
	# 1차
	"Zappos": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Fila": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Vans": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Lacoste": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Adidas": {
		"상": [],
		"중": [],
		"하": [],
	},
    
	"Crocs": {
		"상": [],
		"중": [],
		"하": [],
	},
	"North Face": {
		"상": [],
		"중": [],
		"하": [],
	},
	"North Face Korea": {
		"상": [],
		"중": [],
		"하": [],
	},
	"North Face Youngone": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Columbia": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Salomon": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Asics": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Hoka": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Puma": {
		"상": [],
		"중": [],
		"하": [],
	},
    
	# 1차(한국 주소 자동 연결)
	"Reebok": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Tommy Hilfiger": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Rockport": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Calvin Klein": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Guess": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Ralph Lauren": {
		"상": [],
		"중": [],
		"하": [],
	},
    
    # 2차
	"Patagonia": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Macys": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Gap": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Gap Factory": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Guess Factory": {
		"상": [],
		"중": [],
		"하": [],
	},
    
    # 3차
	"Skechers": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Clarks": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Timberland": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Levis": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Champion": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Keds": {
		"상": [],
		"중": [],
		"하": [],
	},
    
	# 4차
	"Aldo": {
		"상": [],
		"중": [],
		"하": [],
	},
	"New Balance": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Havaianas": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Teva": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Moose Jaw": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Lululemon": {
		"상": [],
		"중": [],
		"하": [],
	},
    
	# 5차
	"Massimo Dutti": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Carters": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Ssense": {
		"상": [],
		"중": [],
		"하": [],
	},
	"Mini Rodini": {
		"상": [],
		"중": [],
		"하": [],
	},
    
	"Fjallraven": {
		"상": [],
		"중": [],
		"하": [],
	},
	
}